[{"id":"75444","link":"/buy/75444/Bio-Island-Milk-Calcium-90-Capsules","name":" Bio Island Milk Calcium 90 Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/75444/original.jpg","price":"19.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Milk Calcium is suitable for use by young infants from the age of 4 weeks, the dosages are based on the Recommended Daily Intakes (RDI) and Adequate Intakes (AI) established by the NHMRC (National Health & Research Council).\nUsing easy to obtain calcium and vitamin D to build strong bones and teeth. With calcium formulated from cow's milk, this product as a daily supplement is beneficial for growth and maintenance of strong, healthy bones. Calcium is also essential from cellular structure, muscle contraction, nerve transmission, enzyme activation and hormone function. Adequate dietary calcium in youth is required to maximise bones and tissues, while vitamin D helps calcium absorption & the immune system. Vitamin D also plays a role in aiding normal regulation of blood sugar in a healthy body.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Vitamin supplements should not replace a balanced diet.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      EACH CAPSULE CONTAINS:Hydroxyapatite   270mgEquiv. to calcium   78 mgCholecalciferol (vitamin D)   2.5 µg\n    \n    \n      Directions\n      Children aged 4 weeks - 6 months take 1 capsule; 7 months -1 year take 2 capsules;1-3 years take 2 - 3 capsules; 4-9 years take 3-4 capsules, or as directed by your healthcare professional. Please take with meal.\n*For children under 4 years, twist or cut the capsule tail and squeeze the contents onto a spoon. The contents can then be administered into the mouth, using the spoon. Alternatively, the dosage can be squeezed onto food.\n    \n    \n      Indications\n      \n      \n  "},{"id":"75439","link":"/buy/75439/Bio-Island-Cod-Liver-Fish-Oil-90-Capsules","name":" Bio Island Cod Liver + Fish Oil 90 Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/75439/original.jpg","price":"19.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Cod Liver + Fish Oil is suitable for use by young infants from the age of 4 weeks, The dosages are based on the Recommended Daily Intakes (RDI) and Adequate Intakes (AI) established by the NHMRC (National Health & Research Council).\nEach capsule contains a blend of nutrients to support the many needs of growing kids. Fish oil contains vital omega-3 unsaturated fatty acids DHA & EPA, which can only be sourced through diet. Cod liver oil is a rich source of vitamins A & D. Vitamin A, with added vitamin E, plays a role in immune mechanisms and vitamin D plays a role in the body in calcium absorption.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Vitamin supplements should not replace a balanced diet.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Cod Liver Oil  275mg  Equiv. to vitamin A  100 µg RE  & cholecalciferol (vitamin D)  0.75 µgFish Oil - Natural 120 mg  Equiv. to omega-3 marine triglycerides  36 mg  As eicosapentaenoic acid (EPA)  21.6 mg  & docosahexaenoic acid (DHA)  14.4 mgD-Alpha Tocopherol (vitamin E) 4.4 mg\n    \n    \n      Directions\n      RECOMMENDED DAILY DOSAGE:Children aged 4 weeks - 1 year take 1 capsule;1-2 years take 2 capsules;2-4 years take 3 capsules;5-9 years take 3-4 capsules, or as directed by your healthcare professional. Please take with meal.\n*For children under 4 years, twist or cut the capsule tail and squeeze the contents onto a spoon. The contents can then be administered into the mouth, using the spoon. Alternatively, the dosage can be squeezed onto food.\n    \n    \n      Indications\n      \n      \n  "},{"id":"75772","link":"/buy/75772/Bio-Island-DHA-for-Pregnancy-60-Softgel-Capsules","name":" Bio Island DHA for Pregnancy 60 Softgel Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/75772/original.jpg","price":"28.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island DHA For Pregnancy is suitable for use by adults including pregnancy and breastfeeding women, the dosages are based on the Recommended Daily Intakes (RDI) and Adequate Intakes (AI) established by the NHMRC (National Health & Research Council).\nSourced naturally from algae, which contains a rich source of docosahexaenoic acid (DHA), an omega-3 fatty acid. Bio Island DHA for Pregnancy contains a concentrated DHA dose. DHA is essential for growth and development of the brain during foetal, neonatal and infant stages. Maternal DHA intake also provides the dual benefits of supporting healthy eye function, nervous system and cognitive function for both mother and child, and can be used during all pregnancy stages, including women trying to conceive or while breastfeeding. Taken daily Bio Island DHA for pregnancy can also help maintain positive wellbeing.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Keep out of reach of children.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      \n    \n    \n      Directions\n      Women trying to conceive and pregnant women between 0 - 10 weeks in their pregnancy take 1 capsule daily. Pregnant women between 10 - 36 weeks and breastfeeding mothers take 2-3 cpaules daily or as directed by your health care professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"75441","link":"/buy/75441/Bio-Island-DHA-60-Capsules","name":" Bio Island DHA 60 Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/75441/original.jpg","price":"17.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island DHA is suitable for use by young infants from the age of 4 weeks, the dosages are based on the Recommended Daily Intakes (RDI) and Adequate Intakes (AI) established by the NHMRC (National Health & Research Council).\nScientifically formulated to support infant development. DHA has essential role in the development of the baby's brain, nervous system & vision both during pregnancy & after birth. DHA supports the development of the eyes during early infancy & also helps maintain health vision in children and adults. Adult dosage may assist in the maintenance of cholesterol & triglycerides within the normal range in healthy individuals, improve HDL: LDL ratio & support cardiovascular health.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      \n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Docosahexaenoic Acid (DHA) rich oil derived  250 mgfrom microalgae Schizochytrium species  Equiv. to docosahexaenoic acid (DHA)  100 mg\n    \n    \n      Directions\n      Children aged 4 weeks - 6 years take 1 capsule;7 -12 years take 2 capsules. Adults, including pregnancy women take 2-3 capsules daily, or as directed by your healthcare professional. Please take with meal.\n*For children under 4 years, twist or cut the capsule tail and squeeze the contents onto a spoon. The contents can then be administered into the mouth, using the spoon. Alternatively, the dosage can be squeezed onto food.\n    \n    \n      Indications\n      \n      \n  "},{"id":"75447","link":"/buy/75447/Bio-Island-Zinc-120-Chewable-Tablets","name":" Bio Island Zinc 120 Chewable Tablets","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/75447/original.jpg","price":"16.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Zinc is suitable for use by children from the age of 1 year, the dosages are based on the Recommended Daily Intakes (RDI) and Adequate Intakes (AI) established by the NHMRC (National Health & Research Council).\nSupplements zinc which may help maintain healthy immune function and blood sugar balance. This product contains zinc, which is an essential trace mineral that is a component in over 200 enzymes in the body. Zinc is an important nutritional antioxidant, thereby assisting in protecting the body against the damaging effects of free radicals and it support the health and function of the immune system. It may also assist in the maintenance of normal healthy blood sugar balance in healthy children. As zinc is involved in carbohydrate metabolism, protein synthesis and cell growth, it helps to maintain healthy skin, vision and eye function and it is necessary for the proper action of many body hormones.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Mineral supplements should not replace a balanced diet.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      EACH TABLET CONTAINS:Zinc Gluconate  21mgEquiv. to zinc  3mg\n    \n    \n      Directions\n      Children aged 1 - 8 years take 1 tablet;9 - 12 years take 2 tablets, or as directed by your healthcare professional*Tablets to be chewed. Recommended for children who can thoroughly chew and safely swallow without supervision. For children under 3 years, please crumble the tablet before chewing.\n    \n    \n      Indications\n      \n      \n  "},{"id":"78228","link":"/buy/78228/Bio-Island-Kangaroo-Essence-50000-90-Vege-Capsules","name":" Bio Island Kangaroo Essence 50000 90 Vege Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/78228/original.jpg","price":"22.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Kangaroo Essence 50000 contains powerful concentrated kangaroo meat powder. The kangaroo is a well-regarded animal for its strength and vigour, and it has long been used in Australia as a nutritive food. Kangaroo meat is high in protein and low in fat. Uniquely Australian Bio Island Kangaroo Essence 50000 offers an essential potent dose of nutrition for both males and females.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Keep out of reach of children.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Kangaroo Powder 100:1 (57%) … 500mg-equiv. to fresh kangaroo meat… 50g (50 000mg)Calcium hydrogen phosphate (341), hydroxypropyl methylcellulose (464), ascorbic acid (300), purified water, carrageenan (407), potassium acetate (261), colours (carmosine, 129, 133, 171)\n    \n    \n      Directions\n      Take 1-2 capsules daily with meals.\n    \n    \n      Indications\n      \n      \n  "},{"id":"78953","link":"/buy/78953/Bio-Island-Lysine-Step-Up-for-Youth-90-Chewable-Tablets","name":" Bio Island Lysine Step Up for Youth 90 Chewable Tablets","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/78953/original.jpg","price":"24.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Lysine Step Up for Youth is deliciously blackcurrant flavoured and contains lysine, an essential amino acid that supports healthy growth and immune function for children, adolescents and young adults. Bio Island Lysine Step Up for Youth supports a variety of body functions during periods of growth and development, where calcium, protein and energy are beneficial. Lysine supports collagen formation and tissue repair, which is important for skin health, muscle growth and wound healing. It assists calcium absorption that helps maintain normal bone structure. It also plays a vital role in the production of energy and carbohydrate metabolism, which may help with the daily energy needs of all ages.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Vitamin and mineral supplements should not replace a balanced diet\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each chewable tablet contains: Lysine Hydrochloride             312.5mg   Equiv to lysine                      250mg*Contains glucose\n    \n    \n      Directions\n      Children aged 6-8 years take 1 tablet; 9-13 years take 2 tablets; 14-24 years take 3 tablets daily or as directed by your healthcare professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"75773","link":"/buy/75773/Bio-Island-Extra-Strength-Collagen-plus-Grape-Seed-Extract-60-Capsules","name":" Bio Island Extra Strength Collagen plus Grape Seed Extract 60 Capsules ","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/75773/original.jpg","price":"22.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Extra Strength Collagen + Grape Seed Extract contains the powerful blend of collagen and grape seed extract, a potent antioxidant. Each of the capsules rich ingredients adds the extra nourishment in your daily routine, working from the inside out.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      \n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Collagen Powder  1000 mgGrape Seed Extract  200mgEquiv. to fresh grape seed  24000mgLyophilised Marine Collagen Powder, Maltrodextrin, Grape Seed Extract Powder, Gelatin, Purified Water, Magnesium Stearate, Silicia Colloidal Anhydrous, Titanium Dioxide\nNUTRITION INFORMATION: Servings per package: 30 Serving Size: 1.5g (2 capsules)\n                                Quantity per Serving (1.5g)  Quantity per 100g Energy                                   22.9 kJ                     1526.93 kJ Protein                                   795 mg                     53 g Fat                                         27 mg                       1.8 g  - Saturated Fat                    0.75 mg                    0.05 gCarbohydrate                        54 mg                       3.6 g - Sugars                                 0 g                            0 g Sodium                                   42 mg                       2.8 g \n    \n    \n      Directions\n      Take 2 capsules daily. Suitable for adults only.\n    \n    \n      Indications\n      \n      \n  "},{"id":"78273","link":"/buy/78273/Bio-Island-Immune-Protect-Propolis-400-Capsules","name":" Bio Island Immune Protect Propolis 400 Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/78273/original.jpg","price":"42.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Immune Protect Propolis is a high strength formula which helps support and maintain a health immune system. The antioxidant functions of propolis assist in protecting the body from harmful effects of free radicals and oxidative stress. Commonly known as a cold tonic, it provides assistance in the treatment of colds and symptoms by reducing their severity and duration. It can also help reduce upper respiratory tract infections and is traditionally used in herbal medicine to help relieve a sore throat. Bio Island Immune Protect Propolis helps in the maintenance of general well-being.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Propolis may cause allergic reactions. If irritation or swelling of the mouth or throat occurs, discontinue use. Keep out of reach of children.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each capsule contains:Propolis Dry Extract (5:1) … 500mgEquiv. to fresh propolis …… 2.5g (2500mg)\n    \n    \n      Directions\n      Adults take 1 capsule daily with meals, or as directed by your healthcare professional. If symptoms persist consult your healthcare professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"78274","link":"/buy/78274/Bio-Island-Eyesight-Support","name":" Bio Island Eyesight Support","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/78274/original.jpg","price":"42.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Eyesight Support is enriched with bilberry and marigold to support eye function and visual stability. The high concentration of bilberry is commonly used as a medicinal herb as it contains anthocyanins, which are potent antioxidants that scavenge free radicals and protect cells against oxidative damage. Combined with marigold, which properties aid in filtering harmful high-energy blue wavelengths of light. Marigold also protects the eye from damage caused by free radicals due to the high volume of antioxidants, helping maintain healthy cells and reduce the risk of chronic eye disease. Bio Island Eyesight Support may improve night vision, slow macular degeneration and prevent cataracts. Offering a unique formula Bio Island Eyesight Support may aid and assist in the maintenance of general wellbeing.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Keep out of reach of children\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each capsule contains:Vaccinium Myrtillus Fruit Extract (100:1) … 120mgEquiv. to vaccinium myrtillus (bilberry) fruit … 12g (12000mg)Tagetes Erecta Flower Extract (80:1) … 50 mgEquiv. to tagetes erecta (marigold) flower … 4g (4000mg\n    \n    \n      Directions\n      Adults take 1-2 capsules daily with meals, or directed by your healthcare professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"79522","link":"/buy/79522/Bio-Island-Lysine-Starter-for-Kids-150g-Oral-Powder","name":" Bio Island Lysine Starter for Kids 150g Oral Powder","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/79522/original.jpg","price":"23.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      The deliciously blackcurrant flavoured Bio Island Lysine Starter for Kids is easy to digest in this convenient powdered form. It contains the essential amino acid lysine, that supports healthy growth and improves appetite for infants and young children.Bio Island Lysine Starter for Kids supports calcium absorption, that helps maintain normal bone structure. Each body cell requires lysine to build proteins, that provides essential nutrients for bodily processes including collagen formation. Lysine can improve appetite and promote growth, especially in young children who may not be consuming enough of their dietary need. It also plays a vital role in the production for energy and carbohydrate metabolism, which may help children with their developing energy needs. As the body cannot product adequate amounts of Lysine, it must be obtained through the diet. Bio Island Lysine Starter for Kids is important for maintaining normal growth and general wellbeing for infants and young children.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      ALLERGEN INFORMATION: This product contains milk.Vitamin and mineral supplements should no replace a balanced diet. \n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each gram contains:Lysine Hydrochloride             115mg   Equiv to lysine                       92mg*1g scoop included\n    \n    \n      Directions\n      Children aged 4weeks - 6 months take 2 scoops (2g) daily; 7months-1 year take 3 scoops (3g) daily; 1-5 years take 4 scoops (4g) daily, or as directed by your healthcare professional. *Children 2+ years can dissolve powder in mouth with saliva, or mix with water, milk or juice as follows: Place 1/2 cup milk or lukewarm water into a container. Add the directed quantity of Bio Island Lysine Starter for Kids and stir until lightly dissolved. Add more milk or water to make up 1 cup. \n    \n    \n      Indications\n      \n      \n  "},{"id":"80318","link":"/buy/80318/Bio-Island-Cherry-Fizz-Multi-For-Kids-Twin-Pack-40-Tablets","name":" Bio Island Cherry Fizz Multi For Kids Twin Pack 40 Tablets","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/80318/original.jpg","price":"15.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Cherry Fizz Multi Effervescent For Kids supports healthy growth and development in young children with a juicy cherry taste kid’s love. It easily dissolves in water to create a bubbly refreshing drink, complete with a careful balance of 20 vitamins and mineral for kids. \n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      ALLERGEN INFORMATION: This product contains sodium bicarbonate. Vitamin or mineral supplements should not replace a balanced diet. \nBelow 25C in a cool, dry place\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each tablet contains equivalent to:Calcium 120mgMagnesium 60mgAscorbic Acid (Vit C)  40mgIron 2.1mgdl-alpha-tocopherol (Vit E)  6mgZinc 5mgNicotinamide (Vit B3) 8mgVitamin A 218RE/µgPantothenic Acid (Vit B5) 3mgCholecalciferol (Vit D) 300IUManganese 1mgCyanocobalamin (Vit B12) 1.3µgRiboflavin (Vit B2) 700µgPyridoxine (Vit B6) 700µgThiamine (Vit B1) 600µgPhytomenadione (Vit K1) 37.5µgFolic Acid 100µgChromium 20µgIodine 75µgBiotin 25µg\n    \n    \n      Directions\n      Children aged 3–8 years; take 1 tablet dissolved in 200 mL of water daily.Children aged 9+ years; take 2 tablets. Dissolve each tablet separately in 200 mL of water daily, or as directed by your healthcare professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"79524","link":"/buy/79524/Bio-Island-Liver-Care-amp-Detox-200-Vege-Capsules","name":" Bio Island Liver Care & Detox 200 Vege Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/79524/original.jpg","price":"22.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Liver Care + Detox is a high strength formula that contains a balanced blend of milk thistle, turmeric and taurine. Milk Thistle, as a liver protectant is traditionally used to maintain liver health and liver related conditions. As a powerful antioxidant, it protects the liver from damage caused by free radical damage or toxins such as alcohol or pollution. Bio Island Liver Care + Detox uses the added benefit of Turmeric, a popular spice with antioxidant properties that improves healthy liver detoxification. Taurine is processed in the liver to product bile salts, and it also functions as an antioxidant to protect the body against oxidative stress. This powerful blend is specifically formulated to help maintain healthy digestive function, in showing your liver proper care. \n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Keep out of reach of children \n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Active Ingredients:Silybum Marianum Fruit Ext. Dry Conc. (70:1) - 500mg    Equiv. to silybum marianum dry fruit 35g (35000mg)Curcuma LONGA Rhizome Ext. Dry Con (20:1) - 30mg    Equiv. to curcuma longa dry rhizome 600mgTaurine - 50mg\n    \n    \n      Directions\n      Adults take 1 capsule daily with meals, or as directed by your healthcare professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"78790","link":"/buy/78790/Bio-Island-Emu-Oil-1000-200-Softgel-Capsules","name":" Bio Island Emu Oil 1000 200 Softgel Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/78790/original.jpg","price":"34.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Contains fatty acids to help improve blood cholesterol levels. Bio Island Emu Oil 1000 is made from 100% natural emu oil and brought to you in convenient capsule form. It contains a rich source of fatty acids - Omegas 3, 6, 7 and 9 that are found naturally in emu oil. The essential fatty acids omegas 3 and 6 cannot be formed in the body and can only be obtained through dietary sources. Research has found that a high total of blood cholesterol can lead to an increased risk of cardiovascular disease. By supporting normal cholesterol levels in health individuals, Bio Island Emu Oil 1000 helps maintain general health and wellbeing. Bio Island Emu Oil 1000 has natural antioxidant and anti-inflammatory properties that can help ease joint and muscle pain, including arthritic conditions. It is also an idea supplement for reducing irritation and inflammation caused by skin disorders, including eczema and dermatitis resulting in naturally healthy looking skin.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      If symptoms persist, please consult your healthcare professional. Keep out of reach of children and do not use if deal on cap is missing, torn or broken.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each capsule contains: Emu Oil     1000mg\n    \n    \n      Directions\n      For health and cholesterol maintenance: Adults take 1-2 capsules daily. For mild-moderate joint inflammation: Adults take 3 capsules, three times daily, or as directed by your healthcare professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"78272","link":"/buy/78272/Bio-Island-Milk-Calcium-Bone-Care-300-Softgel-Capsules","name":" Bio Island Milk Calcium Bone Care 300 Softgel Capsules","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/78272/original.jpg","price":"32.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Milk Calcium Bone Care softgel capsules are specifically formulated with calcium hydroxyapatite, a naturally sourced calcium supplement derived directly from cow’s milk that is effectively absorbed in the body. Calcium is an essential mineral stored in the skeleton for the development and maintenance of healthy bones, teeth, muscle contraction and nerve transmission, and is needed throughout different stages in life. Additional calcium supplementation may be beneficial during adolescence, post menopause, during pregnancy and while breastfeeding. Throughout these periods retention, stable intake and absorption of calcium is required to maximise skeletal bone structure and strength. Bio Island Milk Calcium Bone Care also combines vitamin D3 to enhance calcium absorption in the body, a diet deficient in calcium can lead to osteoporosis in later life. Each capsule also contains the added benefit of vitamin K2, which supports the binding of calcium in bones for stronger bone mineral density in adults. Vitamin K2 also helps to remove calcium from parts of the body where it should not be stored, such as soft tissue, by transporting the calcium to bones and teeth.\n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Mineral and vitamin supplements should not replace a balance diet. Keep out of reach of children.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each soft gel capsule contains:Hydroxyapatite … 550mgEquiv. to calcium … 160 mgCholecalciferol (vitamin D3) … 6.25 µgMenaquinone 7 (vitamin K2) … 17.6 µg\n    \n    \n      Directions\n      Adolescents aged 12-18 years take 2-3 capsules daily; Adults aged 19-50 years take 2 capsules daily; Adults aged 51+ years take 2-3 capsules daily; Pregnant and breastfeeding women take 2-3 capsules daily, or as directed by your healthcare professional. Please take with meal. If symptoms persist consult your health care professional.\n    \n    \n      Indications\n      \n      \n  "},{"id":"79523","link":"/buy/79523/Bio-Island-Super-C-Chews-200-Chewable-Tablets","name":" Bio Island Super C Chews 200 Chewable Tablets","pic":"https://static.chemistwarehouse.com.au/ams/media/productimages/79523/original.jpg","price":"23.99","description":"\n    \n      Information\n      \n    \n    \n      General Information\n      Bio Island Super C Chews offer vitamin C in a new flavour with tasty kiwi fruit and acerola cherry. Kiwi fruit and acerola cherry are both natural and nourishing sources of Vitamin C, which support normal collagen formation require for healthy skin, teeth and gums. You can balance out your day with Bio Island Super C Chews as vitamin C supports the immune system, reduces tiredness and contributed to iron absorption from food. Ready to enjoy, these fruity bites are a smart superfood snack. \n    \n    \n      Miscellaneous\n      \n    \n    \n      Drug Interactions\n      \n    \n    \n      Warnings\n      Keep out of reach of children.\n    \n    \n      Common Uses\n      \n    \n    \n      Ingredients\n      Each tablet contains:Kiwi fruit powder (20%)…400mg    Equiv to fresh kiwi fruit…4gAcerola Extract (0.8%)…16mg    Equiv to acerola fruit…64mgGlucose, calcium hydrogen phosphate, Xylitol, Citric acid, Flavour (Kiwi), Colour (Mint green\n    \n    \n      Directions\n      Tablets to be chewed and not swallowed whole. This product should be taken only by those who can thoroughly chew and swallow without supervision. For children under 3 years, please crumble the tablet before chewing. Suitable for children over 1-year-old, pregnant women and adults.\n    \n    \n      Indications\n      \n      \n  "}]